In [76]:
import numpy as np
import pandas as pd
import seaborn as sns
import plotly.express as px
import plotly.graph_objects as go
import matplotlib.pyplot as plt

In [78]:
#read the csv file
df = pd.read_csv('../layoffs.csv')

In [79]:
#output the head
df.head()

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised
0,Ten Square Games,Wrocław,Consumer,120.0,0.25,2023-04-17,Seed,Poland,NaN
1,Ynsect,Paris,Food,17.0,0.25,2023-04-17,Series D,France,579.0
2,FamPay,Bengaluru,Finance,NaN,NaN,2023-04-17,Series A,India,42.0
3,Kumu,Manila,Media,NaN,NaN,2023-04-17,Series C,Philippines,94.0
4,Quadream,Tel Aviv,Security,NaN,1.00,2023-04-16,Unknown,Israel,NaN

In [80]:
#output the shape
df.shape

(2504, 9)

In [81]:
#output the null tupple count for each attribute
df.isnull().sum()

company                  0
location                 0
industry                 2
total_laid_off         790
percentage_laid_off    844
date                     1
stage                    6
country                  0
funds_raised           240
dtype: int64

In [82]:
#output the rows where industry is NaN , null
df[df['industry'].isnull()]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised
119,Wattpad,Toronto,NaN,42.0,0.15,2023-03-08,Acquired,Canada,117.0
469,Bally's Interactive,Providence,NaN,NaN,0.15,2023-01-18,Post-IPO,United States,946.0

In [83]:
#remove the rows where industry is NaN , null
df = df[~df['industry'].isnull()]

In [84]:
#output the rows where industry is NaN , null
df[df['industry'].isnull()]

Empty DataFrame
Columns: [company, location, industry, total_laid_off, percentage_laid_off, date, stage, country, funds_raised]
Index: []

In [86]:
#output the rows where date is NaN , null
df[df['date'].isnull()]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised
2503,Blackbaud,Charleston,Other,500.0,0.14,NaN,Post-IPO,United States,NaN

In [87]:
#remove the rows where date is NaN , null
df = df[~df['date'].isnull()]

In [88]:
#output the rows where stage is NaN , null
df[df['stage'].isnull()]

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised
531,Verily,SF Bay Area,Healthcare,250.0,0.15,2023-01-11,NaN,United States,3500.0
553,Relevel,Bengaluru,HR,40.0,0.20,2023-01-10,NaN,India,NaN
976,Advata,Seattle,Healthcare,32.0,0.21,2022-10-28,NaN,United States,NaN
982,Spreetail,Austin,Retail,NaN,NaN,2022-10-27,NaN,United States,NaN
1330,Gatherly,Atlanta,Marketing,NaN,0.50,2022-07-31,NaN,United States,NaN
1712,Zapp,London,Food,NaN,0.10,2022-05-25,NaN,United Kingdom,300.0

In [91]:
#remove the rows where stage is NaN , null
df=df[~df['stage'].isnull()]

In [17]:
#fill the cell values to 0 where column is number and is NaN or not available
df = df.fillna(0)

In [18]:
df.isnull().sum()

company                0
location               0
industry               0
total_laid_off         0
percentage_laid_off    0
date                   0
stage                  0
country                0
funds_raised           0
dtype: int64

In [21]:
#save it to the new file
df.to_csv('layoffs_cleaned.csv', index=False)

In [20]:
df.shape

(2495, 9)